9/data/attachments/e99fa493f2c125b0.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b8a33106-67bf-4912-84c1-bc40c6913898</nif:username>
            <nif:friendToBeAdded>Lawrence_town_Friend_5006_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>